{
  "title": "Kalindi Cliff Killer: A Kothari Family Feud",
  "setting": "Remote Indian Mountain Lodge",
  "victim": {
    "name": "Rajan \"Raj\" Kothari",
    "profession": "Lodge Manager & Herbal Medicine Practitioner",
    "lastKnownLocation": "Near the Kalindi River, collecting herbs",
    "deathTimeEstimate": "22:45",
    "causeOfDeath": "Pushed from cliff edge; evidence of struggle and distinct bruising from a traditional walking stick.",
    "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751135334/obscura/victims/obscura/victims/Rajan%20%22Raj%22%20Kothari_portrait.jpg"
  },
  "suspects": [
    {
      "name": "Priya Kothari",
      "role": "Rajan's younger sister, aspiring wildlife photographer",
      "alibi": "Priya claims she was in her cabin (Cabin #3) reviewing wildlife photos she took earlier that day, specifically focusing on a rare black panther sighting. She states she worked until 23:30, only stopping when her laptop battery died. She insists she didn't hear or see anything unusual. The charger for her laptop was broken earlier that week, and she has no backup.",
      "motives": [
        "Resentment over Rajan's favoritism from their father. Their father always saw Rajan as the responsible one, handing him the lodge management and control over family herbal remedies, while Priya's artistic ambitions were dismissed.",
        "Rajan disapproved of Priya's relationship with a local forest guide named Dev, believing him to be beneath her and potentially after the family's wealth. Rajan threatened to disown her if she continued seeing him.",
        "Subconsciously, Priya blames Rajan for their mother's death years ago. He was supposed to gather specific herbs for her treatment, but he was late, something that Priya deeply resents and has never been able to forgive him for. "
      ],
      "isKiller": false,
      "personality": "Priya is introverted and fiercely independent. She presents a calm, almost detached facade, but beneath the surface lies a simmering resentment and a deep well of unexpressed emotions. She is passionate about her photography and wildlife conservation, but her artistic pursuits are often overshadowed by the Kothari family drama. She is observant and meticulous, but prone to passive-aggressive behavior when confronted.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751135355/obscura/suspects/obscura/suspects/Priya%20Kothari_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "I saw Vikram arguing with Rajan near the staff quarters earlier that day. It sounded heated, something about money and Vikram owing Rajan a debt. I couldn't make out all the words, but Vikram seemed really angry.",
          "triggerType": "gentle",
          "triggerLevel": 2,
          "triggerDescription": "Expressing concern about the family and the investigation, assuring her her observations matter.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Yes, my laptop charger was broken. But Dev helped me fix it temporarily. He's good with electronics, even though Rajan looked down on him.",
          "triggerType": "specific_question",
          "triggerLevel": 3,
          "triggerDescription": "Directly ask about the broken laptop charger, specifically challenging the alibi point of no power after the battery died.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        },
        {
          "clue": "Rajan was...difficult. He never understood my art. He always thought the herbal remedies held more value, that my passion was childish and frivolous. He was possessive of the family \"legacy.\"",
          "triggerType": "sympathetic",
          "triggerLevel": 2,
          "triggerDescription": "Expressing understanding of her artistic struggles and the perceived lack of validation from her brother.",
          "isRedHerring": false,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "I might have taken a short walk. It helps clear my head when I'm stressed, you know, with the family and my art... but I swear, I remained within a few minutes of the cabin. I only went in the direction of the waterfall. There were some unique birds I wanted to photograph.",
          "triggerType": "aggressive",
          "triggerLevel": 4,
          "triggerDescription": "Aggressively questioning the precise details of her alibi, pointing out inconsistencies and potential gaps in her story.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "The black panther sighting...it was real. I enhanced some details in post, the lighting wasn't great, but I was really there. I wouldn't risk my credibility as a photographer for some little detail. If you check the metadata on my camera, it'll support my time and location claim - or at least that I was out in the forest near cabin #3.",
          "triggerType": "pressing",
          "triggerLevel": 3,
          "triggerDescription": "Presenting irrefutable evidence that suggests her alibi is flawed (e.g., witness testimony, camera metadata shows a different time or general activity), creating discomfort and attempting to corner her.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        }
      ]
    },
    {
      "name": "Vikram Desai",
      "role": "Rajan's childhood friend and the lodge's head chef",
      "alibi": "Vikram states he was preparing the breakfast menu and stocktaking in the kitchen from 21:00 until 23:00. He says he was alone for the entire duration except for brief interactions with kitchen staff members, Rohan and Leela, when they were cleaning up their stations at around 21:15.",
      "motives": [
        "Vikram believes Rajan has been embezzling money from the lodge's profits and refusing to distribute the promised bonuses to the staff. He feels betrayed by his friend's greed.",
        "Vikram is secretly in love with Rajan's wife, Anjali, and hopes to win her over now that Rajan is out of the picture. He sees Rajan as an obstacle to his happiness.",
        "Vikram carries a hidden guilt over a past incident where he accidentally revealed a family secret of the Kotharis to outsiders when he was drunk, damaging the family's reputation. He fears Rajan would expose his fault and ruin him."
      ],
      "isKiller": false,
      "personality": "Vikram is a jovial and outwardly friendly man, known for his delicious curries and warm hospitality. However, beneath his cheerful exterior, he harbors deep-seated insecurities and a tendency to be manipulative. He is fiercely loyal to his friends, but can turn vindictive if betrayed. He is also prone to fits of anger when his insecurities are triggered.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751135356/obscura/suspects/obscura/suspects/Vikram%20Desai_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "Rajan and I had a disagreement a few days before... a rather heated one, actually. It was about the new menu; he thought my fish curry wasn't 'authentic' enough for our clientele. Can you believe that? Me, the head chef!",
          "triggerType": "gentle",
          "triggerLevel": 1,
          "triggerDescription": "Start with general questions about his relationship with Rajan. Acknowledge his expertise as a chef and ask about any recent disagreements.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "Look, I admit, I was angry that Rajan was being selfish with the lodge profits. We all work so hard, and he was hoarding the money for himself. I overheard him on the phone, talking about offshore accounts. Rohan and Leela must have heard too. But angry doesn't mean I *killed* him.",
          "triggerType": "aggressive",
          "triggerLevel": 3,
          "triggerDescription": "Accuse him directly of having a strong motive, based on his financial frustrations and Rajan's perceived greed. Push back if he denies being angry.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Anjali? Oh, she's a wonderful woman. So kind, so... everything Rajan didn't deserve, really. He treated her terribly. Always working, never paying her any attention. I just hope she's alright.",
          "triggerType": "sympathetic",
          "triggerLevel": 2,
          "triggerDescription": "Express sympathy for Anjali's situation as the grieving widow and ask Vikram how he thinks she's coping. Observe his reaction carefully.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "I remember that evening pretty well... I was in the kitchen all night, making sure I had all the measurements ready for breakfast. From around 9, only Rohan and Leela were still cleaning up the kitchen. They came in and out to get things to and from storage. I never saw either one of them leave the lodge, though... as far as I know. However, I had my head down in a book doing stock take from roughly 22:00 to 23:00... I'm sure they were gone before then...",
          "triggerType": "specific_question",
          "triggerLevel": 4,
          "triggerDescription": "Ask Vikram to go through the exact timeline of his alibi in as much detail as possible, focusing on the comings and goings of Rohan and Leela.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        },
        {
          "clue": "Rajan and I...we have been friends for ages. He helped me when I made a huge mistake years ago and I was incredibly thankful for that! I would never hurt him! I just wish I could've been there for him more recently...maybe things would have been different.",
          "triggerType": "pressing",
          "triggerLevel": 5,
          "triggerDescription": "Press Vikram on how close he and Rajan truly were. Start hinting at the knowledge of any possible tension between the two friends.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        }
      ]
    },
    {
      "name": "Anjali Kothari",
      "role": "Rajan's wife, a former city lawyer",
      "alibi": "Anjali claims she was in her room (Cabin #1) suffering from a migraine and took sleeping pills at 21:30. She says she fell asleep immediately and didn't wake up until the next morning. She has a history of migraines, and empty medicine packets were found in her cabin, but forensic analysis shows they contained a herbal sedative, not her prescribed medication.",
      "motives": [
        "Anjali feels trapped in her marriage with Rajan. She gave up her successful law career in Mumbai to move to the remote lodge, and she misses her old life and the intellectual stimulation it provided. She resents Rajan for isolating her.",
        "She discovered that Rajan had a secret affair with a local tribal woman and was planning to leave her for her. She felt humiliated and betrayed by his infidelity.",
        "The cliff edge area where the body was found was also the location where Anjali and Rajan had their wedding ceremony. Rajan was now threatening to re-develop the location against Anjali's wishes."
      ],
      "isKiller": false,
      "personality": "Anjali is intelligent and sophisticated, but also deeply unhappy. She is well-spoken and maintains a composed demeanor, but there is a noticeable sadness in her eyes. She is observant and perceptive, but often struggles to express her true feelings. She is meticulous and detail-oriented, a habit from her legal career, making her alibi sound well-constructed and credible.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751135360/obscura/suspects/obscura/suspects/Anjali%20Kothari_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "Yes, I took something for my migraine. Just the herbal stuff, though. My prescription was… misplaced. It wasn't strong enough anyway.",
          "triggerType": "gentle",
          "triggerLevel": 2,
          "triggerDescription": "Ask about her migraine medication with concern.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Rajan… he could be… difficult. He had his own vision for the lodge, which I didn't always agree with. Especially that plan for developing the cliff edge area. It's where we got married.",
          "triggerType": "sympathetic",
          "triggerLevel": 3,
          "triggerDescription": "Express understanding of the pressures she faced at the lodge. Refer to the wedding ceremony.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Vikram? He was Rajan's right-hand man. Always around. Always… eager to please. Seemed to resent Rajan's family. I always suspected there was more to their relationship than met the eye.",
          "triggerType": "specific_question",
          "triggerLevel": 3,
          "triggerDescription": "Ask directly about Vikram Desai's relationship with Rajan.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "He and Priya were always fighting. Seemed like that girl was desperate to get married to Rajan but Rajan was reluctant because of me.",
          "triggerType": "aggressive",
          "triggerLevel": 4,
          "triggerDescription": "Confront her with the evidence of Rajan's affair and the implication that she had a motive for revenge. Show photographic evidence of Rajan and Priya arguing.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Look, I told you, I took the sleeping pills at 21:30. But honestly, I remember being groggy much later, I might have woken up once in the middle of the night. Maybe to drink water, I cannot recall exactly what time it was.",
          "triggerType": "pressing",
          "triggerLevel": 5,
          "triggerDescription": "Repeatedly challenge the precise timing of her alibi, focusing on the discrepancies in her story. Use the fact that the herbal sedative would not have immediately knocked her out.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        }
      ]
    },
    {
      "name": "Arjun Kothari",
      "role": "Rajan's estranged elder brother, gambler and former black sheep of the family",
      "alibi": "Arjun claims he was in the nearby town of Rampur, at a local tea stall, from 21:00 onwards, playing cards with local men. He claims he can't remember their names due to being intoxicated. He claims he went back to his accommodation in Rampur around midnight.",
      "motives": [
        "Arjun is deeply in debt due to his gambling addiction. He believed that Rajan would financially help him out of his crisis by giving him money from the Kothari family trust, and that if Rajan was gone, Arjun would be the next in line and would have access to the funds.",
        "Arjun holds a long-standing grudge against Rajan for being the 'golden child' who always received their parents' love and approval. He felt constantly compared to Rajan and resented his success.",
        "Arjun was previously banished from the Kothari estate after stealing from his parents. After his banishment, Arjun was spotted on the cliff with Rajan, who was trying to calm down his elder brother. Arjun was seen holding the family's ceremonial walking stick."
      ],
      "isKiller": true,
      "personality": "Arjun is charismatic and impulsive, but also unreliable and prone to making bad decisions. He is a smooth talker and can easily charm people, but he is also easily swayed by temptation. He is resentful of his brother's success and feels entitled to the family's wealth. He is quick to anger and often acts without thinking, leading him into trouble. He is emotionally stunted and prone to self-destructive behavior.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751135356/obscura/suspects/obscura/suspects/Arjun%20Kothari_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "Look, I was at the tea stall in Rampur. Ask around! There were plenty of guys there. We were playing Teen Patti. I probably lost more than I should have. The tea was terrible, though.",
          "triggerType": "gentle",
          "triggerLevel": 2,
          "triggerDescription": "Casually inquire about his alibi and the details of his evening in Rampur.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Rajan and I... we had our differences, sure. But family is family. He was going to help me out, you know? With a small loan. He promised. Why would I hurt someone who was finally coming around? He knew about my, uh, 'situation' and he finally offered a way out.",
          "triggerType": "sympathetic",
          "triggerLevel": 3,
          "triggerDescription": "Express sympathy for his financial troubles and imply Rajan was the only one who cared.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "That stick? The ceremonial one? Yes, I saw it. It was near the... gazebo. Rajan had it earlier that day. Said he was going for a walk. Why are you asking about the stick, huh? Is it missing?",
          "triggerType": "aggressive",
          "triggerLevel": 4,
          "triggerDescription": "Accuse him of being seen with the murder weapon (walking stick) earlier in the day, before the crime occurred.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        },
        {
          "clue": "Rampur? Of course I was in Rampur! I needed... space. Rajan was being difficult, he was lecturing me, threatening to tell father about my debts. He made me furious... I mean, upset. And yes I stormed off toward the cliff... But I calmed down and went to Rampur. I swear!",
          "triggerType": "pressing",
          "triggerLevel": 3,
          "triggerDescription": "Press him on the motive of the will. Mention Rajan's reluctance to give money.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Look, I was banished. Okay? So what? Rajan didn't want me around. He was always better than me. I was never good enough. But I swear, I didn't kill him. I just wanted some of the money that was rightly owed to me!",
          "triggerType": "specific_question",
          "triggerLevel": 5,
          "triggerDescription": "Ask him about the reasons for his banishment from the Kothari estate.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        }
      ]
    }
  ],
  "killer": "Arjun Kothari",
  "locations": [
    "Kalindi River Cliff Edge (Crime Scene)",
    "Rajan's Cabin (#2)",
    "Lodge Kitchen",
    "Arjun's Accommodation in Rampur",
    "Priya's Cabin (#3)"
  ],
  "clues": {
    "Kalindi River Cliff Edge (Crime Scene)": [
      "Fragments of a broken walking stick, identified as a Kothari family heirloom, are found near the cliff edge. The wood matches the specific type used for ceremonial walking sticks in their region of Rajasthan, confirmed by a local craftsman. The stick is missing its silver handle.",
      "Soil samples at the immediate edge show signs of disturbance – a scuff mark consistent with a foot slipping. Embedded in the soil are minute fibers matching the blend used in Arjun's shawl, which he always carries. Forensic analysis determines that Rajan's blood is also present on the fibers.",
      "A partially smudged footprint, size 10 (approximate), is found in the soft earth a few feet back from the edge. It’s difficult to get a perfect cast, but initial analysis suggests it's a common type of hiking boot worn by both locals and tourists. However, closer examination reveals traces of a rare type of mud only found near the tea stall in Rampur where Arjun claims to have been.",
      "The autopsy report confirms Rajan's time of death as approximately 22:45. Weather reports indicate a brief but intense rain shower passed through the area between 22:30 and 23:00. This could have washed away some evidence or distorted footprints. An analysis of the pollen found on Rajan's clothing shows a high concentration of a rare Himalayan poppy species that is only found at a specific elevation on the opposite side of the river.",
      "A used matchstick from a specific brand of cigarettes only found in Rampur is discovered near the crime scene. Arjun Kothari is known to smoke this brand."
    ],
    "Rajan's Cabin (#2)": [
      "Rajan's desk contains a ledger detailing the lodge's finances. The last entry, dated the day of his death, shows a large, unauthorized withdrawal labeled 'A.K.' – presumably Arjun Kothari. The amount is significant and would likely cover a portion of Arjun's gambling debts.",
      "Tucked under Rajan's mattress is a small, locked wooden box. Inside, a crumpled photograph shows Rajan and a local tribal woman in a compromising position, along with a torn piece of paper with Anjali's handwriting: 'You will pay for this betrayal.'",
      "A half-finished herbal remedy sits on Rajan's workbench, with a note indicating it's for Anjali's migraine. However, the ingredients list contains a potent but slowly acting poison, identified as *aconitum*. The dosage is low enough to mimic migraine symptoms initially but would eventually lead to organ failure. Rajan's notebook has the following entry for the day of his death 'I think Anjali is planning to poison me, I must find a way to replace the medicine without her knowing'.",
      "An opened letter addressed to Rajan from a creditor in Rampur details Arjun's gambling debts and threatens violence if not paid immediately. The letter is postmarked three days before Rajan's death. The letter ends by saying 'Your brother's life is in your hands.'"
    ],
    "Lodge Kitchen": [
      "Vikram's knife block contains one empty slot where a paring knife should be. Vikram claims he was using it to chop vegetables earlier but cannot locate it. There are traces of blood on the handle of another knife, which Vikram says came from cutting himself earlier that day.",
      "Security camera footage from the kitchen shows Vikram disposing of a small plastic bag in the garbage disposal at 23:15. When questioned, he claims it was just vegetable scraps. However, the disposal's filter yields traces of *aconitum*, the same poison found in Rajan's cabin.",
      "Rohan, a kitchen staff member, states that Vikram seemed agitated and distracted all evening, muttering about Rajan's 'betrayal' and 'greed'. He also recalls Vikram sharpening his knives with unusual intensity.",
      "Leela, another kitchen staff member, testifies that she saw Vikram leave the kitchen at approximately 22:30, carrying something wrapped in a cloth. He returned about 20 minutes later looking flustered and didn't say where he had been."
    ],
    "Arjun's Accommodation in Rampur": [
      "Arjun's room is sparsely furnished. Under the bed, investigators find a bloodstained shawl. The blood type matches Rajan's. He claims he got into a fight with some locals the previous night, but there are no visible injuries on Arjun. The shawl also has traces of Himalayan poppy pollen similar to those found on Rajan's clothes.",
      "A discarded bus ticket from Rampur to a stop near the mountain lodge is found in Arjun's trash can. The ticket is dated the day of Rajan's death, with a departure time of 20:00 and an arrival time of 21:30. When questioned, Arjun says he did not leave Rampur.",
      "A pawn shop receipt from Rampur shows that Arjun pawned a silver handle – matching the description of the missing walking stick handle – earlier that day. He received a surprisingly low price for it, suggesting he was desperate for cash.",
      "A local tea stall owner, Mahesh, remembers Arjun playing cards at his stall the night of Rajan's death. However, Mahesh also recalls Arjun receiving a phone call around 21:00, during which he stepped away and spoke in hushed tones. Mahesh overheard the words 'family', 'lodge', and 'money'."
    ],
    "Priya's Cabin (#3)": [
      "Priya's laptop, despite its dead battery, contains a hidden folder with digitally enhanced images of Rajan meeting secretly with the tribal woman, including timestamps. The metadata suggests the photos were taken over the past few weeks. The photos were taken from the mountain side overlooking the lodge.",
      "Priya's camera bag contains a small vial of plant extract. When questioned, she said she uses it for photography. Forensic analysis shows traces of the same species of Himalayan Poppy. The vial is labeled 'poison'.",
      "A handwritten journal entry from Priya reveals her deep resentment towards Rajan, accusing him of ruining her life and stifling her artistic ambitions. She also mentions her secret wish to see him suffer.",
      "Priya's broken laptop charger is examined, and it appears to have been deliberately damaged. The damage is not consistent with wear and tear, but rather intentional tampering."
    ]
  },
  "witnesses": {
    "Kalindi River Cliff Edge (Crime Scene)": [
      {
        "name": "Lakshmi, a local shepherdess",
        "role": "Shepherdess",
        "background": "Lakshmi lives in a small village near the lodge and grazes her goats on the mountainside. She is known for her sharp eyesight and keen observation skills.",
        "testimony": "Lakshmi claims she saw two men arguing near the cliff edge around 22:00, but she couldn't identify them in the darkness. She heard raised voices and what sounded like a struggle, followed by a loud thud. Then she spotted someone running away.",
        "reliability": "Fairly reliable, but her eyesight might be affected by the darkness. She is also slightly superstitious and might embellish her story.",
        "hiddenAgenda": "Lakshmi is secretly involved in smuggling rare herbs from the mountains and might be hesitant to reveal too much for fear of attracting attention to herself."
      }
    ],
    "Rajan's Cabin (#2)": [
      {
        "name": "Dev, local forest guide",
        "role": "Priya's romantic partner",
        "background": "Dev is a local forest guide who knows the mountain terrain intimately. He has a deep understanding of local flora and fauna. Rajan disapproved of their relationship.",
        "testimony": "Dev claims he visited Rajan earlier that day to discuss potential collaborations on eco-tourism initiatives. He insists their conversation was friendly and professional. He expresses his shock and sadness at Rajan's death.",
        "reliability": "Potentially unreliable. He is in a romantic relationship with Priya, making his testimony biased. He might also have ulterior motives for wanting Rajan out of the picture.",
        "hiddenAgenda": "Dev may have been involved in gathering intelligence for Priya about Rajan's movements and secret meetings."
      }
    ],
    "Lodge Kitchen": [],
    "Arjun's Accommodation in Rampur": [
      {
        "name": "Mahesh, tea stall owner",
        "role": "Tea stall owner",
        "background": "Mahesh runs a small tea stall in Rampur. He is a gossip and knows everyone's business in town. He is talkative and enjoys sharing information.",
        "testimony": "Mahesh remembers Arjun playing cards at his stall the night of Rajan's death. However, Mahesh also recalls Arjun receiving a phone call around 21:00, during which he stepped away and spoke in hushed tones. Mahesh overheard the words 'family', 'lodge', and 'money'.",
        "reliability": "Mostly reliable, but prone to exaggeration and misremembering details. He enjoys being the center of attention.",
        "hiddenAgenda": "Mahesh might be holding back information to protect his business or avoid getting involved in a police investigation."
      }
    ],
    "Priya's Cabin (#3)": []
  },
  "timeline": [
    {
      "time": "21:00",
      "event": "Two days prior: Arjun arrives in Rampur, checking into a cheap guesthouse near the tea stall. He immediately makes a call to Rajan, demanding money, which Rajan refuses."
    },
    {
      "time": "10:00",
      "event": "Day before the murder: Priya spends the morning photographing wildlife near the Kalindi River, focusing on the area close to the cliff edge. Her laptop battery is already low."
    },
    {
      "time": "12:00",
      "event": "Day before the murder: Vikram argues with Rajan in the lodge kitchen regarding the staff bonuses. Rajan dismisses his concerns, further fueling Vikram's resentment. The argument is overheard by Rohan, a kitchen staff member."
    },
    {
      "time": "14:00",
      "event": "Day before the murder: Anjali discovers a text message on Rajan's phone from a local tribal woman named Sita, confirming her suspicions of his affair. She confronts Rajan, who brushes it off."
    },
    {
      "time": "16:00",
      "event": "Day before the murder: Arjun is seen near the lodge by Lakshmi the shepherdess, observing Rajan's movements. He carries the family's ceremonial walking stick."
    },
    {
      "time": "18:00",
      "event": "Day before the murder: Dev visits Priya in her cabin. Rajan sees them together and confronts Priya later, threatening to disown her. Priya expresses deep resentment toward Rajan after the argument. Their voices are overheard by Anjali who happened to be taking a walk nearby."
    },
    {
      "time": "20:00",
      "event": "Day of the murder: Vikram prepares a special spice blend for Rajan's dinner, knowing Rajan is allergic to one of the ingredients in small amounts. This is Vikram's misguided attempt to make Rajan ill and therefore less influential."
    },
    {
      "time": "20:30",
      "event": "Day of the murder: Anjali tells Rajan she wants to discuss re-developing the wedding spot location. Rajan agrees to meet her there the next day."
    },
    {
      "time": "21:00",
      "event": "Day of the murder: Arjun calls Rajan from a local tea stall, he is overheard arguing about 'family', 'lodge' and 'money'. Priya is in her cabin, editing the photos from the day, as her laptop battery depletes rapidly. She makes a mental note to get the charger fixed."
    },
    {
      "time": "21:15",
      "event": "Day of the murder: Vikram is in the kitchen, preparing for breakfast. Rohan and Leela briefly interact with him while cleaning up."
    },
    {
      "time": "21:30",
      "event": "Day of the murder: Anjali takes a herbal sedative, claiming it is her migraine medication. She is alone in her cabin, but the cabin door is not properly latched."
    },
    {
      "time": "21:45",
      "event": "Day of the murder: Rajan informs the lodge staff that he is going to collect herbs near the Kalindi River, which is part of his daily routine. No surveillance footage exists for this location. He sets off with the family's ceremonial walking stick for protection."
    },
    {
      "time": "22:00",
      "event": "Day of the murder: Lakshmi sees two men arguing near the Kalindi River cliff edge but cannot identify them in the dark. She hears a struggle and a thud."
    },
    {
      "time": "22:15",
      "event": "Day of the murder: Arjun confronts Rajan near the Kalindi River cliff edge. He demands money and threatens to expose Rajan's embezzlement. Rajan refuses, a struggle ensues, and Arjun pushes Rajan off the cliff with the walking stick. The walking stick leaves a distinct bruise."
    },
    {
      "time": "22:30",
      "event": "Day of the murder: Arjun flees the scene, rushing back towards Rampur to establish his alibi at the tea stall. He disposes of Rajan's wallet in a nearby ravine."
    },
    {
      "time": "22:45",
      "event": "Day of the murder: Rajan Kothari dies from the fall off the cliff edge. The time of death is estimated based on body temperature and rigor mortis."
    },
    {
      "time": "23:00",
      "event": "Day of the murder: Vikram finishes his stocktaking in the kitchen and heads to his room, unaware of what has happened. He thinks that his plan to make Rajan ill is progressing."
    },
    {
      "time": "06:00",
      "event": "Next Day: A lodge guest discovers Rajan's body at the bottom of the cliff near the Kalindi River. The local police are immediately notified. The family feud has finally ended in tragedy."
    }
  ]
}