{
  "title": "Desert Oasis Revenge: The Priya Sharma Gambit",
  "setting": "Desert Oasis Goa Casino",
  "victim": {
    "name": "Priya Sharma",
    "profession": "High-Stakes Poker Dealer at the Desert Oasis Casino",
    "lastKnownLocation": "VIP Poker Room, Desert Oasis Casino",
    "deathTimeEstimate": "03:17",
    "causeOfDeath": "Asphyxiation; evidence suggests tampering with the oxygen supply to her private dealing booth leading to a sudden, unexpected drop in oxygen levels.",
    "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751136540/obscura/victims/obscura/victims/Priya%20Sharma_portrait.jpg"
  },
  "suspects": [
    {
      "name": "Vikram 'Vik' Kapoor",
      "role": "Casino Owner's Son and High Roller",
      "alibi": "Vik claims he was playing high-stakes Baccarat in the VIP lounge from 01:00 AM to 04:00 AM. He states several other high rollers, including Mr. Sharma (no relation to Priya), and Mr. Desai, can corroborate his presence. He also alleges he was quite drunk and doesn't remember specific hands after 02:30 AM, relying on others' accounts.",
      "motives": [
        "Revenge for a public humiliation: Priya exposed Vik's card-counting scheme during a televised poker tournament six months ago, costing him a significant amount of money and his reputation among the Goa elite. He swore vengeance in a drunken rage afterwards.",
        "Protection of his family's reputation: Priya was rumored to be compiling evidence of illegal gambling practices within the casino, potentially implicating Vik and his father.",
        "Unrequited affection and obsession: Vik was reportedly infatuated with Priya and repeatedly tried to pursue a relationship with her. Her constant rejections fueled resentment and a sense of entitlement."
      ],
      "isKiller": true,
      "personality": "Arrogant, entitled, and impulsive. Vik is used to getting his way due to his family's wealth and influence. He's a risk-taker, both in gambling and in life, but prone to emotional outbursts and rash decisions when his ego is bruised. He hides his insecurities beneath a veneer of confidence and a charming smile that can quickly turn cold. He has a gambling problem, which exacerbates his poor judgement.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751136567/obscura/suspects/obscura/suspects/Vikram%20%27Vik%27%20Kapoor_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "Yeah, I was there that night. Baccarat. Lost a fortune, actually. Mr. Sharma can vouch for me. I was plastered, though. Couldn't tell you what time it was, let alone what hands I was playing after a certain point.",
          "triggerType": "gentle",
          "triggerLevel": 1,
          "triggerDescription": "Initial, general questioning about his whereabouts on the night of the murder. Establishing his alibi.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Priya? Look, she was… ambitious. Okay? Let's just say she rubbed some people the wrong way. Casino politics, you know? Someone probably didn't like her digging around. I wouldn't be surprised if Deepa had something to do with it, always seemed jealous of Priya's attention from my father.",
          "triggerType": "pressing",
          "triggerLevel": 3,
          "triggerDescription": "Questioning about Priya's character and potential enemies within the casino. Highlighting the dangers of casino politicking.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "Okay, okay, fine! So what if I lost money because of her? It was a stupid poker game! I was drunk! She humiliated me in front of everyone! But I would never… I just yelled at her, okay? I said some things I didn’t mean! Is that a crime now?",
          "triggerType": "aggressive",
          "triggerLevel": 4,
          "triggerDescription": "Confronting him directly with the public humiliation and asking specifically about his reaction to it in the immediate aftermath (yelling at Priya).",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "(After repeated denials and being presented with circumstantial evidence) Alright, alright, I saw her that night...earlier, around 12:30, by the pool...we argued. About...about my gambling. She was lecturing me, again. I told her to leave me alone and I went inside. That's it!",
          "triggerType": "pressing",
          "triggerLevel": 5,
          "triggerDescription": "Continual pressure, presenting fabricated evidence (e.g., security footage of someone resembling Vik near the crime scene), and questioning his alibi until he admits to seeing her on the night of the murder.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        },
        {
          "clue": "Look, I get that it looks bad, okay? Me, drunk, angry... but I swear, I didn't *plan* anything. After we argued, I went to the VIP lounge and drowned my sorrows in Baccarat. I won some back, then lost it all again. Ask Sharma, he saw me. He probably won the rest of my money.",
          "triggerType": "sympathetic",
          "triggerLevel": 2,
          "triggerDescription": "Using a sympathetic approach, suggesting that circumstances might make him look guilty even if he's innocent. This encourages him to elaborate on his actions.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        }
      ]
    },
    {
      "name": "Anita Desai",
      "role": "Head of Security at Desert Oasis Casino",
      "alibi": "Anita insists she was reviewing security footage in her office from 02:00 AM to 04:00 AM, ensuring the casino's safety during the late-night hours. She states she was alone and focused on the screens, making a point of noting suspicious activity near the cash cage around 02:45 AM, necessitating a brief patrol of the area.",
      "motives": [
        "Professional Jealousy and ambition: Anita felt Priya's popularity with high-roller clients was overshadowing her own authority and expertise within the casino. She saw Priya as a threat to her career advancement.",
        "Cover-up of a previous security lapse: Priya was aware of a prior incident where Anita failed to properly secure a high-roller suite, resulting in a minor theft. Priya threatened to report the incident if Anita didn't help her expose the casino's illegal activities.",
        "Guilt and complicity in illegal activities: Anita has been turning a blind eye to some illegal gambling and laundering activities at the casino at the instruction of Vikram's father for a significant cut of the profits. Priya threatened to expose this which would implicate Anita."
      ],
      "isKiller": false,
      "personality": "Disciplined, observant, and fiercely loyal to the casino (at least on the surface). Anita is a highly competent security professional with a sharp mind and a no-nonsense attitude. However, she is also deeply ambitious and willing to compromise her ethics to climb the corporate ladder. She is meticulous and organized, but also secretive and distrustful of others.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751136560/obscura/suspects/obscura/suspects/Anita%20Desai_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "I noticed Rahul arguing with Priya near the roulette tables earlier that evening, around 10 PM. It looked pretty heated, something about debts and favors.",
          "triggerType": "gentle",
          "triggerLevel": 2,
          "triggerDescription": "Simply express concern about the casino staff's well-being and ask if she noticed any unusual interactions that evening.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "Look, I admit, Priya and I weren't exactly friends. She was getting a lot of attention from the VIPs, which… well, it made things competitive. But I wouldn't kill her. I wouldn't risk everything I've worked for.",
          "triggerType": "pressing",
          "triggerLevel": 3,
          "triggerDescription": "Directly accuse her of being jealous of Priya and suggest she had a motive.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "The security cameras... there was an issue with one of the cameras near the service entrance that night. It kept flickering. I filed a report to get it fixed, but you know how maintenance can be. It probably wouldn't have caught anything important anyway.",
          "triggerType": "specific_question",
          "triggerLevel": 4,
          "triggerDescription": "Ask specifically about the reliability of the security cameras and any known issues that night.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        },
        {
          "clue": "Vikram's father... he sometimes asks for... certain things to be overlooked. It's nothing illegal, just... favors for valued clients. Priya knew some things about those favors, and she threatened to disclose them if I didn't help her to take down Vikram's father's illegal operation.",
          "triggerType": "aggressive",
          "triggerLevel": 5,
          "triggerDescription": "Accuse her of turning a blind eye to illegal activities in the casino for personal gain, and imply Priya was blackmailing her.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        },
        {
          "clue": "That night, I was doing my rounds and I saw Deepa acting strangely. She was in the hallway near the victim's office, fidgeting with her hands and looking around as if she was hiding from someone. It was around 3:15 AM.",
          "triggerType": "sympathetic",
          "triggerLevel": 3,
          "triggerDescription": "Express understanding of the pressure she might be under and appeal to her sense of justice to come forward with any information she might have.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        }
      ]
    },
    {
      "name": "Rahul Verma",
      "role": "Former Security Guard at Desert Oasis Casino, fired 3 months ago",
      "alibi": "Rahul claims he was at a local dhaba (roadside restaurant) called 'Sharma's Dhaba' from 02:00 AM to 04:00 AM, eating parathas and drinking chai. He states the owner, Mr. Sharma (unrelated to the victim), can vouch for his presence, along with several truckers who frequent the establishment.",
      "motives": [
        "Wrongful Termination and resentment: Rahul believes Priya was responsible for his dismissal from the casino three months ago. He was fired for allegedly sleeping on the job, but he claims Priya fabricated the story because he had rebuffed her advances.",
        "Financial desperation: Rahul is heavily in debt and struggling to find work since his termination. He blames Priya for his misfortunes and believes she ruined his life.",
        "Stalking and Obsession: Rahul had developed a deep obsession with Priya after her rejecting his advances, leading him to stalk her and constantly harass her for her phone number. Him getting fired for sleeping on the job was directly because he was watching her private booth to try and catch her alone."
      ],
      "isKiller": false,
      "personality": "Paranoid, resentful, and emotionally unstable. Rahul is convinced that the world is against him and that he is a victim of injustice. He is quick to anger and prone to irrational behavior. He is desperate for money and attention, and willing to resort to extreme measures to get what he wants. He is socially awkward and struggles to form meaningful relationships.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751136561/obscura/suspects/obscura/suspects/Rahul%20Verma_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "I told Priya that if she didn't leave me alone, she would regret it! She was always following me around the casino. I just wanted her to stop!",
          "triggerType": "aggressive",
          "triggerLevel": 3,
          "triggerDescription": "Accuse Rahul of having a volatile relationship with Priya and directly suggest he threatened her. This plays into his paranoia and makes him defensive.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "Sharma's Dhaba? Yeah, I was there all night. Had...uh...three parathas, I think? Maybe four? And plenty of chai. Sharma remembers me. He always does. He knows I'm a good customer, even if I didn't have much money that night.",
          "triggerType": "gentle",
          "triggerLevel": 2,
          "triggerDescription": "Casually inquire about his alibi and gauge his reaction. The slight hesitation and uncertainty about the number of parathas could indicate nervousness or a fabricated alibi.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "It's not fair! They fired me because of her! Sleeping on the job? That's a lie! She set me up! She knew I was watching her booth, and then she told the boss I was sleeping. She was always talking to Vik Kapoor, laughing at me. He probably told her to do it! He's got money, he gets away with everything.",
          "triggerType": "sympathetic",
          "triggerLevel": 4,
          "triggerDescription": "Express sympathy for his situation and suggest that Priya's actions were unfair and might have been motivated by someone else. This will make him speak about Vik Kapoor.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "I saw Anita arguing with Priya a few weeks ago, behind the casino. It looked pretty intense. I couldn't hear what they were saying, but Anita seemed really angry. I was on patrol, so I had to keep moving.",
          "triggerType": "pressing",
          "triggerLevel": 3,
          "triggerDescription": "Press Rahul about any unusual activity he witnessed at the casino in the weeks leading up to the murder. His desire to appear helpful (and maybe deflect suspicion) might lead him to reveal information about other suspects.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "Look, I admit I wasn't thrilled about Priya. But stalking? That's a strong word. I just... admired her. From a distance. Okay, maybe I tried to get her number a few times. But she wouldn't give it to me! It's not a crime to like someone, is it?",
          "triggerType": "specific_question",
          "triggerLevel": 2,
          "triggerDescription": "Directly question him about any incidents where he stalked or harassed Priya. His attempt to downplay his behavior will reveal the extent of his obsession.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        }
      ]
    },
    {
      "name": "Deepa Mukherjee",
      "role": "Priya's Best Friend and fellow Poker Dealer",
      "alibi": "Deepa states she was at her apartment from 02:00 AM to 04:00 AM, preparing for an upcoming poker tournament. She claims she was reviewing strategy videos online and practicing her card shuffling techniques. She lives alone and has no witnesses to corroborate her alibi.",
      "motives": [
        "Revenge for a betrayal: Priya had an affair with Deepa's fiancé, causing their wedding to be called off. Deepa discovered the affair only a week ago and has been secretly seething with rage ever since.",
        "Financial incentive: Priya was the beneficiary of a large life insurance policy. Deepa, facing significant debt, knew of the policy and how it would solve all her problems. Priya may have told Deepa some details of the policy which would help Deepa get the money.",
        "Guilt and Self-Loathing: Deepa felt incredibly guilty about having to betray her best friend, even if Priya had betrayed her first. Deepa loved Priya like a sister, and she might have felt like she had no other choice and might feel horrible about that fact after it happened."
      ],
      "isKiller": false,
      "personality": "Outwardly friendly and supportive, but inwardly harboring deep resentment and insecurity. Deepa is a skilled poker dealer and a talented player, but she lacks the confidence to truly shine. She is often envious of Priya's success and popularity. She is prone to emotional outbursts, but tries to maintain a calm and collected exterior.",
      "portrait": "https://res.cloudinary.com/dsnfa3dlu/image/upload/v1751136562/obscura/suspects/obscura/suspects/Deepa%20Mukherjee_portrait.jpg",
      "cluesTriggers": [
        {
          "clue": "I remember Priya mentioning she'd had a disagreement with Vikram earlier that evening, something about a high-stakes poker game and Vik owing her money. She seemed really agitated by it.",
          "triggerType": "gentle",
          "triggerLevel": 2,
          "triggerDescription": "Employing a calm and reassuring tone, asking about Priya's relationships with the other staff.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "I was at my apartment practicing card shuffling around that time. It's true. That new tournament is giving me anxiety and I just needed to focus.",
          "triggerType": "aggressive",
          "triggerLevel": 3,
          "triggerDescription": "Repeatedly questioning the validity of her alibi, highlighting the lack of witnesses and potential for fabrication.",
          "isRedHerring": false,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "Priya had confided in me that she recently updated her life insurance policy. She was excited about setting up her family for the future.",
          "triggerType": "sympathetic",
          "triggerLevel": 4,
          "triggerDescription": "Expressing genuine sorrow for Priya's death and appealing to Deepa's sense of empathy.",
          "isRedHerring": true,
          "importance": "minor",
          "revealed": false
        },
        {
          "clue": "I saw Anita with Priya near the pool earlier that night. I don't know what they were talking about, but Anita looked really mad. She was waving her hands around, it seemed heated.",
          "triggerType": "specific_question",
          "triggerLevel": 3,
          "triggerDescription": "Directly asking if Deepa observed any tense or unusual interactions between Priya and other individuals present that night.",
          "isRedHerring": false,
          "importance": "important",
          "revealed": false
        },
        {
          "clue": "I... I did know about Priya and my ex-fiancé. I found out last week. It was awful, but I would never hurt her. We talked. I yelled, she cried, but it... it was mostly resolved. I was still mad but I could never do that.",
          "triggerType": "pressing",
          "triggerLevel": 5,
          "triggerDescription": "Presenting irrefutable evidence of Deepa's knowledge of the affair and then confronting her with the potential motive of revenge. Watching her for any inconsistencies when she denies committing the crime itself.",
          "isRedHerring": false,
          "importance": "critical",
          "revealed": false
        }
      ]
    }
  ],
  "killer": "Vikram 'Vik' Kapoor",
  "locations": [
    "VIP Poker Room, Desert Oasis Casino (Priya's Booth)",
    "Desert Oasis Casino Security Office",
    "Sharma's Dhaba (Roadside Restaurant)",
    "Vikram Kapoor's Private Suite, Desert Oasis Casino",
    "Desert Oasis Casino Oxygen Supply Room"
  ],
  "clues": {
    "VIP Poker Room, Desert Oasis Casino (Priya's Booth)": [
      "A faint scent of sandalwood incense, Priya's signature fragrance, lingers in the air, noticeably weaker than usual. Priya always kept a small incense stick burning. An almost burnt out stick of sandalwood incense is found hidden behind Priya's workstation.",
      "A smudge of bright red lipstick, not Priya's usual matte nude, is on the oxygen supply vent cover inside the booth. It's a shade similar to the one Vik's seen sporting on dates lately.",
      "Priya's last hand log on the casino's computer system shows a large, unusual bet placed by Vik Kapoor at 03:05 AM. The bet was unusually high and seemingly out of character for the game being played.",
      "A small, intricately carved silver charm depicting Lord Ganesha is found tucked inside Priya's dealing shoe. It's a common Hindu symbol of good luck and obstacle removal, but Priya wasn't known to be particularly religious. The charm appears recently polished."
    ],
    "Desert Oasis Casino Security Office": [
      "Security footage from 03:15 AM shows Anita Desai, Head of Security, making a brief, unscheduled visit to the oxygen supply room. She appears to be adjusting something on the wall. The footage quality is slightly grainy, but she is visible.",
      "Anita's computer has a log file showing she accessed Priya's personnel file at 02:58 AM, specifically focusing on Priya's medical history and emergency contact information. There's also a record of her accessing the casino's HVAC system schematic.",
      "A discarded coffee cup with Anita's fingerprints on it is found in the trash can. The cup has a lipstick stain matching the bright red shade found in Priya's booth, with the same DNA type present."
    ],
    "Sharma's Dhaba (Roadside Restaurant)": [
      "Mr. Sharma, the dhaba owner, confirms that Rahul Verma was at the dhaba between 02:00 AM and 04:00 AM. However, he also mentions Rahul was agitated and kept checking his phone, making several short phone calls outside the dhaba.",
      "A crumpled receipt from Sharma's Dhaba, dated the night of the murder and time stamped 02:47 AM, is found in Rahul's pocket during a subsequent search. The receipt shows a purchase of one chai and one plate of parathas, a relatively small order.",
      "Traces of red soil, characteristic of the area surrounding the Desert Oasis Casino, are found embedded in the treads of Rahul's shoes, despite him claiming to have spent the entire night at the dhaba, which is on a paved road."
    ],
    "Vikram Kapoor's Private Suite, Desert Oasis Casino": [
      "A half-empty bottle of expensive scotch, Vik's preferred brand, is found in his mini-bar. A fingerprint analysis reveals a faint smudge of sandalwood incense on the bottle's neck.",
      "Vik's Baccarat scorecard shows inconsistent handwriting and several erasures around the time of the murder (03:00 - 03:30 AM). His winnings are significantly lower than usual for a high-stakes player.",
      "A torn piece of paper from a Desert Oasis Casino oxygen supply maintenance logbook is found crumpled in the wastebasket. The page lists scheduled maintenance for the VIP poker room oxygen supply on the night of the murder. The technician who made the notation has signed off on it.",
      "Security footage shows Vik leaving his suite at 03:00 AM, wearing a dark hooded sweatshirt, and returning at 03:25 AM. His gait appears hurried, and he avoids the main casino floor, taking a service elevator instead."
    ],
    "Desert Oasis Casino Oxygen Supply Room": [
      "The oxygen regulator for Priya's booth has been tampered with. The valve was deliberately set to restrict oxygen flow, causing a gradual reduction in oxygen levels. Fine metal filings are found around the valve, suggesting it was forced open.",
      "A faint impression of a Baccarat playing card – the Queen of Hearts – is found etched into the dust on the oxygen tank regulator valve. The Queen of Hearts was the card Priya used to expose Vik's cheating in the televised poker tournament.",
      "A partial footprint, size 11, is found on the floor, near the oxygen tank. The tread pattern matches a limited-edition Italian leather loafer – a style known to be favored by Vikram Kapoor.",
      "A small CCTV camera is hidden inside the oxygen supply room, disguised as a fire sprinkler. The footage from 03:10 AM to 03:20 AM shows Vik Kapoor tampering with the oxygen regulator, with Anita Desai standing guard at the door."
    ]
  },
  "witnesses": {
    "VIP Poker Room, Desert Oasis Casino (Priya's Booth)": [
      {
        "name": "Rajesh Mehta",
        "role": "High-Stakes Poker Player",
        "background": "A wealthy businessman from Mumbai, known for his impeccable memory and observation skills at the poker table.",
        "testimony": "Rajesh claims to have seen Vik Kapoor arguing with Priya earlier in the evening, around 11:00 PM. He overheard Vik saying, \"You'll regret crossing me, Priya.\"",
        "reliability": "High, but Rajesh is a known gossip and enjoys stirring up drama.",
        "hiddenAgenda": "Rajesh has a history of betting against Vik Kapoor and might be trying to manipulate the investigation to his advantage."
      }
    ],
    "Desert Oasis Casino Security Office": [],
    "Sharma's Dhaba (Roadside Restaurant)": [
      {
        "name": "Lakshmi Bai",
        "role": "Tea Vendor near Sharma's Dhaba",
        "background": "Sells chai near Sharma's Dhaba every night. Observant and knows everyone's business.",
        "testimony": "Lakshmi recalls seeing Rahul walk past her tea stall sometime between 2:30-3:00 AM. She said he looked sweaty and agitated, and she noticed him quickly heading in the direction of the Desert Oasis Casino.",
        "reliability": "Medium, Lakshmi is known for exaggerating stories.",
        "hiddenAgenda": "Lakshmi frequently clashes with Mr. Sharma over territory and might be trying to hurt his business by providing misleading information."
      }
    ],
    "Vikram Kapoor's Private Suite, Desert Oasis Casino": [
      {
        "name": "Mr. Sharma (no relation to Priya)",
        "role": "High-Stakes Baccarat Player",
        "background": "A frequent guest at the casino, known for his stoic demeanor and lack of emotion, regardless of whether he is winning or losing.",
        "testimony": "Mr. Sharma confirms Vik was at the Baccarat table during the stated time. But when asked about specifics, he states that he was concentrating on his game and did not keep a close watch on Mr. Kapoor during the timeframe he was there.",
        "reliability": "High, though he may be hesitant to get involved in a police investigation because of his social status.",
        "hiddenAgenda": "Mr. Sharma might be indebted to the Kapoor family and reluctant to provide information that could incriminate Vik."
      }
    ],
    "Desert Oasis Casino Oxygen Supply Room": []
  },
  "timeline": [
    {
      "time": "15:30",
      "event": "Priya Sharma receives a bouquet of red roses at the Desert Oasis Casino's VIP Poker Room, delivered anonymously. A small card reads: \"You can't hide forever.\""
    },
    {
      "time": "16:00",
      "event": "Vikram 'Vik' Kapoor is seen losing a substantial amount of money at a high-stakes poker game in the VIP lounge. He slams his fist on the table and storms off, muttering about \"that Sharma woman\" costing him everything. This is captured on security camera #4 near the VIP lounge entrance."
    },
    {
      "time": "17:45",
      "event": "Rahul Verma, visibly agitated, calls Priya Sharma's mobile phone. The call goes unanswered and he leaves a rambling voicemail accusing her of ruining his life. Cell tower data places him near the Desert Oasis Casino."
    },
    {
      "time": "18:30",
      "event": "Anita Desai, Head of Security, conducts a routine security check of the casino's oxygen supply room. She makes a mental note of a slightly loose panel on one of the oxygen tanks, but doesn't report it. This omission will later be revealed to be a critical error, she thought nothing of it."
    },
    {
      "time": "20:00",
      "event": "Priya meets Deepa Mukherjee for dinner at a local restaurant. Deepa subtly probes Priya about her life insurance policy. Priya mentions she recently updated it, but doesn't disclose the beneficiary."
    },
    {
      "time": "21:30",
      "event": "Vik visits Priya's dealing booth. Rajesh Mehta, a high-stakes player, overhears Vik arguing with Priya, saying, \"You'll regret crossing me, Priya.\" This occurs just outside the VIP room, Rajesh says. He reports that a few other patrons heard the argument, but didn't get too close."
    },
    {
      "time": "22:00",
      "event": "Rahul Verma is spotted by Lakshmi Bai, a tea vendor, loitering outside the Desert Oasis Casino. He appears to be watching the entrance."
    },
    {
      "time": "22:30",
      "event": "Anita Desai is called to Vik Kapoor's private suite to address a minor security concern. He complains about noise from the hallway. The interaction is brief, but Anita is seen smiling and nodding reassuringly."
    },
    {
      "time": "23:00",
      "event": "Priya texts Deepa: \"Something feels off tonight. Vik was acting strange.\""
    },
    {
      "time": "00:30",
      "event": "Rahul Verma sends Priya a series of increasingly frantic and obsessive text messages. He demands to know why she won't respond to him and threatens to come to the casino."
    },
    {
      "time": "01:00",
      "event": "Vik Kapoor begins playing high-stakes Baccarat in the VIP lounge, as per his alibi. Mr. Sharma (no relation to Priya) is among the other players."
    },
    {
      "time": "01:45",
      "event": "Vik excuse himself from the Baccarat table, ostensibly to use the restroom, but he is out of view of the security cameras for approximately 7 minutes. He goes to the oxygen supply room and tampers with Priya's booth supply."
    },
    {
      "time": "02:00",
      "event": "Anita Desai begins her shift reviewing security footage in her office. She focuses primarily on the cash cage area, as per her alibi."
    },
    {
      "time": "02:30",
      "event": "Rahul Verma arrives at Sharma's Dhaba and orders parathas and chai. Mr. Sharma (the dhaba owner) confirms his presence."
    },
    {
      "time": "02:45",
      "event": "Anita Desai spots suspicious activity near the cash cage on security camera #7 and leaves her office to investigate. She returns approximately 15 minutes later."
    },
    {
      "time": "02:45",
      "event": "Lakshmi Bai sees Rahul Verma walking quickly past her tea stall, heading in the direction of the Desert Oasis Casino. He is sweating and looks agitated."
    },
    {
      "time": "03:17",
      "event": "Priya Sharma dies in her private dealing booth in the VIP Poker Room due to asphyxiation. The oxygen level in the booth plummets suddenly."
    },
    {
      "time": "03:25",
      "event": "Vik returns to the Baccarat table. Mr. Sharma does not notice anything amiss about his demeanor. Vik is clearly winning."
    },
    {
      "time": "04:15",
      "event": "Deepa Mukherjee arrives at the Desert Oasis Casino for her morning shift. She finds Priya unresponsive in her booth and alerts security."
    }
  ]
}